# Combining Datasets: Merge and Join

One essential feature offered by Pandas is its high-performance, in-memory join and merge operations.
If you have ever worked with databases, you should be familiar with this type of data interaction.
The main interface for this is the ``pd.merge`` function, and we'll see few examples of how this can work in practice.

For convenience, we will start by redefining the ``display()`` functionality from the previous section:

In [1]:
import pandas as pd
import numpy as np

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

## Relational Algebra

The behavior implemented in ``pd.merge()`` is a subset of what is known as *relational algebra*, which is a formal set of rules for manipulating relational data, and forms the conceptual foundation of operations available in most databases.
The strength of the relational algebra approach is that it proposes several primitive operations, which become the building blocks of more complicated operations on any dataset.
With this lexicon of fundamental operations implemented efficiently in a database or other program, a wide range of fairly complicated composite operations can be performed.

Pandas implements several of these fundamental building-blocks in the ``pd.merge()`` function and the related ``join()`` method of ``Series`` and ``Dataframe``s.
As we will see, these let you efficiently link data from different sources.

## Categories of Joins

The ``pd.merge()`` function implements a number of types of joins: the *one-to-one*, *many-to-one*, and *many-to-many* joins.
All three types of joins are accessed via an identical call to the ``pd.merge()`` interface; the type of join performed depends on the form of the input data.
Here we will show simple examples of the three types of merges, and discuss detailed options further below.

### One-to-one joins

Perhaps the simplest type of merge expresion is the one-to-one join, which is in many ways very similar to the column-wise concatenation seen in [Combining Datasets: Concat & Append](03.06-Concat-And-Append.ipynb).
As a concrete example, consider the following two ``DataFrames`` which contain information on several employees in a company:

In [4]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1', 'df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

To combine this information into a single ``DataFrame``, we can use the ``pd.merge()`` function:

In [5]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

The ``pd.merge()`` function recognizes that each ``DataFrame`` has an "employee" column, and automatically joins using this column as a key.
The result of the merge is a new ``DataFrame`` that combines the information from the two inputs.
Notice that the order of entries in each column is not necessarily maintained: in this case, the order of the "employee" column differs between ``df1`` and ``df2``, and the ``pd.merge()`` function correctly accounts for this.
Additionally, keep in mind that the merge in general discards the index, except in the special case of merges by index (see the ``left_index`` and ``right_index`` keywords, discussed momentarily).

### Many-to-one joins

Many-to-one joins are joins in which one of the two key columns contains duplicate entries.
For the many-to-one case, the resulting ``DataFrame`` will preserve those duplicate entries as appropriate.
Consider the following example of a many-to-one join:

In [6]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
display('df3', 'df4', 'pd.merge(df3, df4)')

df3
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

pd.merge(df3, df4)
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

The resulting ``DataFrame`` has an aditional column with the "supervisor" information, where the information is repeated in one or more locations as required by the inputs.

### Many-to-many joins

Many-to-many joins are a bit confusing conceptually, but are nevertheless well defined.
If the key column in both the left and right array contains duplicates, then the result is a many-to-many merge.
This will be perhaps most clear with a concrete example.
Consider the following, where we have a ``DataFrame`` showing one or more skills associated with a particular group.
By performing a many-to-many join, we can recover the skills associated with any individual person:

In [7]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
display('df1', 'df5', "pd.merge(df1, df5)")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

pd.merge(df1, df5)
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

These three types of joins can be used with other Pandas tools to implement a wide array of functionality.
But in practice, datasets are rarely as clean as the one we're working with here.
In the following section we'll consider some of the options provided by ``pd.merge()`` that enable you to tune how the join operations work.

## Specification of the Merge Key

We've already seen the default behavior of ``pd.merge()``: it looks for one or more matching column names between the two inputs, and uses this as the key.
However, often the column names will not match so nicely, and ``pd.merge()`` provides a variety of options for handling this.

### The ``on`` keyword

Most simply, you can explicitly specify the name of the key column using the ``on`` keyword, which takes a column name or a list of column names:

In [10]:
display('df1', 'df2', "pd.merge(df1, df2, on='employee')")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

pd.merge(df1, df2, on='employee')
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

This option works only if both the left and right ``DataFrame``s have the specified column name.

### The ``left_on`` and ``right_on`` keywords

At times you may wish to merge two datasets with different column names; for example, we may have a dataset in which the employee name is labeled as "name" rather than "employee".
In this case, we can use the ``left_on`` and ``right_on`` keywords to specify the two column names:

In [14]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
display('df1', 'df3', 'pd.merge(df1, df3, left_on="employee", right_on="name")')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1, df3, left_on="employee", right_on="name")
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

The result has a redundant column that we can drop if desiredâ€“for example, by using the ``drop()`` method of ``DataFrame``s:

In [19]:
dff = pd.merge(df1, df3, left_on="employee", right_on="name")
dff = dff.drop(columns=['name'])
dff

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

### The ``left_index`` and ``right_index`` keywords

Sometimes, rather than merging on a column, you would instead like to merge on an index.
For example, your data might look like this:

In [20]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
display('df1a', 'df2a')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

You can use the index as the key for merging by specifying the ``left_index`` and/or ``right_index`` flags in ``pd.merge()``:

In [21]:
display('df1a', 'df2a',
        "pd.merge(df1a, df2a, left_index=True, right_index=True)")

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(df1a, df2a, left_index=True, right_index=True)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [26]:
display('df1', 'df2a',
        "pd.merge(df1, df2a, right_index=True, left_on='employee')")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(df1, df2a, right_index=True, left_on='employee')
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

For convenience, ``DataFrame``s implement the ``join()`` method, which performs a merge that defaults to joining on indices:

In [11]:
display('df1a', 'df2a', 'df1a.join(df2a)')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

df1a.join(df2a)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

If you'd like to mix indices and columns, you can combine ``left_index`` with ``right_on`` or ``left_on`` with ``right_index`` to get the desired behavior:

In [12]:
display('df1a', 'df3', "pd.merge(df1a, df3, left_index=True, right_on='name')")

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1a, df3, left_index=True, right_on='name')
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

All of these options also work with multiple indices and/or multiple columns; the interface for this behavior is very intuitive.
For more information on this, see the ["Merge, Join, and Concatenate" section](http://pandas.pydata.org/pandas-docs/stable/merging.html) of the Pandas documentation.

## Specifying Set Arithmetic for Joins

In all the preceding examples we have glossed over one important consideration in performing a join: the type of set arithmetic used in the join.
This comes up when a value appears in one key column but not the other. Consider this example:

In [28]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
display('df6', 'df7', 'pd.merge(df6, df7)')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7)
   name   food drink
0  Mary  bread  wine

Here we have merged two datasets that have only a single "name" entry in common: Mary.
By default, the result contains the *intersection* of the two sets of inputs; this is what is known as an *inner join*.
We can specify this explicitly using the ``how`` keyword, which defaults to ``"inner"``:

In [14]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

Other options for the ``how`` keyword are ``'outer'``, ``'left'``, and ``'right'``.
An *outer join* returns a join over the union of the input columns, and fills in all missing values with NAs:

In [15]:
display('df6', 'df7', "pd.merge(df6, df7, how='outer')")

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how='outer')
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

The *left join* and *right join* return joins over the left entries and right entries, respectively.
For example:

In [14]:
display('df6', 'df7', "pd.merge(df6, df7, how='left')")

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how='left')
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [16]:
display('df6', 'df7', "pd.merge(df6, df7, how='right')")

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how='right')
     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [29]:
display('df7', 'df6', "pd.merge(df7, df6, how='left')")

df7
     name drink
0    Mary  wine
1  Joseph  beer

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

pd.merge(df7, df6, how='left')
     name drink   food
0    Mary  wine  bread
1  Joseph  beer    NaN

The output rows now correspond to the entries in the left input. Using
``how='right'`` works in a similar manner.

All of these options can be applied straightforwardly to any of the preceding join types.

## Overlapping Column Names: The ``suffixes`` Keyword

Finally, you may end up in a case where your two input ``DataFrame``s have conflicting column names.
Consider this example:

In [30]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
display('df8', 'df9', 'pd.merge(df8, df9, on="name")')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8, df9, on="name")
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

Because the output would have two conflicting column names, the merge function automatically appends a suffix ``_x`` or ``_y`` to make the output columns unique.
If these defaults are inappropriate, it is possible to specify a custom suffix using the ``suffixes`` keyword:

In [33]:
display('df8', 'df9', 'pd.merge(df8, df9, on="name", suffixes=["_2021", "_2022"])')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8, df9, on="name", suffixes=["_2021", "_2022"])
   name  rank_2021  rank_2022
0   Bob          1          3
1  Jake          2          1
2  Lisa          3          4
3   Sue          4          2

These suffixes work in any of the possible join patterns, and work also if there are multiple overlapping columns.

For more information on these patterns, see [Aggregation and Grouping](03.08-Aggregation-and-Grouping.ipynb) where we dive a bit deeper into relational algebra.
Also see the [Pandas "Merge, Join and Concatenate" documentation](http://pandas.pydata.org/pandas-docs/stable/merging.html) for further discussion of these topics.

## Example: US States Data

Merge and join operations come up most often when combining data from different sources.
Here we will consider an example of some data about US states and their populations.
The data files can be found at http://github.com/jakevdp/data-USstates/:

In [19]:
# Following are shell commands to download the data (already downloaded)
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0
  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0
100 57935  100 57935    0     0  36199      0  0:00:01  0:00:01 --:--:--  138k
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   835  100   835    0     0   2510      0 --:--:-- --:--:-- --:--:--  2625
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   872  100   872    0     0   2508      0 --:--:-- --:--:-- --:--:--  2634

Let's take a look at the three datasets, using the Pandas ``read_csv()`` function:

In [34]:
pop = pd.read_csv('data/state-population.csv')
areas = pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')

display('pop.head()', 'areas.head()', 'abbrevs.head()')

pop.head()
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

abbrevs.head()
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [39]:
abbrevs.abbreviation.unique()

array(['AL', 'AK', 'AZ', 'AR', 'CA', 'CO', 'CT', 'DE', 'DC', 'FL', 'GA',
       'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'KY', 'LA', 'ME', 'MT', 'NE',
       'NV', 'NH', 'NJ', 'NM', 'NY', 'NC', 'ND', 'OH', 'OK', 'OR', 'MD',
       'MA', 'MI', 'MN', 'MS', 'MO', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX',
       'UT', 'VT', 'VA', 'WA', 'WV', 'WI', 'WY'], dtype=object)

In [37]:
mask = abbrevs["abbreviation"] == "PR"
abbrevs[mask]

Empty DataFrame
Columns: [state, abbreviation]
Index: []

In [35]:
pop[pop["population"].isnull()]

     state/region     ages  year  population
2448           PR  under18  1990         NaN
2449           PR    total  1990         NaN
2450           PR    total  1991         NaN
2451           PR  under18  1991         NaN
2452           PR    total  1993         NaN
2453           PR  under18  1993         NaN
2454           PR  under18  1992         NaN
2455           PR    total  1992         NaN
2456           PR  under18  1994         NaN
2457           PR    total  1994         NaN
2458           PR    total  1995         NaN
2459           PR  under18  1995         NaN
2460           PR  under18  1996         NaN
2461           PR    total  1996         NaN
2462           PR  under18  1998         NaN
2463           PR    total  1998         NaN
2464           PR    total  1997         NaN
2465           PR  under18  1997         NaN
2466           PR    total  1999         NaN
2467           PR  under18  1999         NaN

In [40]:
pop["population"].isnull().sum()

20

Given this information, say we want to compute a relatively straightforward result: rank US states and territories by their 2010 population density.
We clearly have the data here to find this result, but we'll have to combine the datasets to find the result.

We'll start with a many-to-one merge that will give us the full state name within the population ``DataFrame``.
We want to merge based on the ``state/region``  column of ``pop``, and the ``abbreviation`` column of ``abbrevs``.
We'll use ``how='outer'`` to make sure no data is thrown away due to mismatched labels.

In [42]:
# merged = merged.iloc[:, list(range(1)) +\
#                     [list(merged.columns).index("state")] +\
#                     list(range(2, list(merged.columns).index("state"))) +\
#                     list(range(list(merged.columns).index("state") +1, len(merged.columns)))]

def reindex(df, colname, pos):
    ls_cols = list(df.columns)
    idx_old_col = ls_cols.index(colname)
    try:
        ls_cols_new = ls_cols[:pos] + [colname] + ls_cols[(pos+1):idx_old_col] + ls_cols[idx_old_col + 2:]
    except:
        ls_cols_new = ls_cols[:pos] + [colname] + ls_cols[(pos+1):idx_old_col]
    return df[ls_cols_new]

reindex(merged, "state", 3)

     state/region     ages  year    state
0              AL  under18  2012  Alabama
1              AL    total  2012  Alabama
2              AL  under18  2010  Alabama
3              AL    total  2010  Alabama
4              AL  under18  2011  Alabama
...           ...      ...   ...      ...
2539          USA    total  2010      NaN
2540          USA  under18  2011      NaN
2541          USA    total  2011      NaN
2542          USA  under18  2012      NaN
2543          USA    total  2012      NaN

[2544 rows x 4 columns]

In [41]:
display("abbrevs.head()", "pop.head()", "areas.head()")

abbrevs.head()
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

pop.head()
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [43]:
areas.state.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'Florida', 'Georgia',
       'Hawaii', 'Idaho', 'Illinois', 'Indiana', 'Iowa', 'Kansas',
       'Kentucky', 'Louisiana', 'Maine', 'Maryland', 'Massachusetts',
       'Michigan', 'Minnesota', 'Mississippi', 'Missouri', 'Montana',
       'Nebraska', 'Nevada', 'New Hampshire', 'New Jersey', 'New Mexico',
       'New York', 'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma',
       'Oregon', 'Pennsylvania', 'Rhode Island', 'South Carolina',
       'South Dakota', 'Tennessee', 'Texas', 'Utah', 'Vermont',
       'Virginia', 'Washington', 'West Virginia', 'Wisconsin', 'Wyoming',
       'District of Columbia', 'Puerto Rico'], dtype=object)

In [42]:
pop[pop["state/region"]=="PR"]

     state/region     ages  year  population
2448           PR  under18  1990         NaN
2449           PR    total  1990         NaN
2450           PR    total  1991         NaN
2451           PR  under18  1991         NaN
2452           PR    total  1993         NaN
2453           PR  under18  1993         NaN
2454           PR  under18  1992         NaN
2455           PR    total  1992         NaN
2456           PR  under18  1994         NaN
2457           PR    total  1994         NaN
2458           PR    total  1995         NaN
2459           PR  under18  1995         NaN
2460           PR  under18  1996         NaN
2461           PR    total  1996         NaN
2462           PR  under18  1998         NaN
2463           PR    total  1998         NaN
2464           PR    total  1997         NaN
2465           PR  under18  1997         NaN
2466           PR    total  1999         NaN
2467           PR  under18  1999         NaN
2468           PR    total  2000   3810605.0
2469           PR  under18  2000   1089063.0
2470           PR    total  2001   3818774.0
2471           PR  under18  2001   1077566.0
2472           PR    total  2002   3823701.0
2473           PR  under18  2002   1065051.0
2474           PR    total  2004   3826878.0
2475           PR  under18  2004   1035919.0
2476           PR    total  2003   3826095.0
2477           PR  under18  2003   1050615.0
2478           PR    total  2005   3821362.0
2479           PR  under18  2005   1019447.0
2480           PR    total  2006   3805214.0
2481           PR  under18  2006    998543.0
2482           PR    total  2007   3782995.0
2483           PR  under18  2007    973613.0
2484           PR    total  2008   3760866.0
2485           PR  under18  2008    945705.0
2486           PR  under18  2013    814068.0
2487           PR    total  2013   3615086.0
2488           PR    total  2009   3740410.0
2489           PR  under18  2009    920794.0
2490           PR    total  2010   3721208.0
2491           PR  under18  2010    896945.0
2492           PR  under18  2011    869327.0
2493           PR    total  2011   3686580.0
2494           PR  under18  2012    841740.0
2495           PR    total  2012   3651545.0

In [47]:
pop.shape

(2544, 4)

In [46]:
pop_abb = pd.merge(pop, abbrevs, how="left", left_on="state/region", right_on="abbreviation").drop(columns=["abbreviation"])
pop_abb

     state/region     ages  year   population    state
0              AL  under18  2012    1117489.0  Alabama
1              AL    total  2012    4817528.0  Alabama
2              AL  under18  2010    1130966.0  Alabama
3              AL    total  2010    4785570.0  Alabama
4              AL  under18  2011    1125763.0  Alabama
...           ...      ...   ...          ...      ...
2539          USA    total  2010  309326295.0      NaN
2540          USA  under18  2011   73902222.0      NaN
2541          USA    total  2011  311582564.0      NaN
2542          USA  under18  2012   73708179.0      NaN
2543          USA    total  2012  313873685.0      NaN

[2544 rows x 5 columns]

In [50]:
pop_abb[pop_abb["state"].isnull()]["state/region"].unique()

array(['PR', 'USA'], dtype=object)

In [52]:
pop_abb[pop_abb["state/region"] == "USA"]

     state/region     ages  year   population state
2496          USA  under18  1990   64218512.0   NaN
2497          USA    total  1990  249622814.0   NaN
2498          USA    total  1991  252980942.0   NaN
2499          USA  under18  1991   65313018.0   NaN
2500          USA  under18  1992   66509177.0   NaN
2501          USA    total  1992  256514231.0   NaN
2502          USA    total  1993  259918595.0   NaN
2503          USA  under18  1993   67594938.0   NaN
2504          USA  under18  1994   68640936.0   NaN
2505          USA    total  1994  263125826.0   NaN
2506          USA  under18  1995   69473140.0   NaN
2507          USA  under18  1996   70233512.0   NaN
2508          USA    total  1995  266278403.0   NaN
2509          USA    total  1996  269394291.0   NaN
2510          USA    total  1997  272646932.0   NaN
2511          USA  under18  1997   70920738.0   NaN
2512          USA  under18  1998   71431406.0   NaN
2513          USA    total  1998  275854116.0   NaN
2514          USA  under18  1999   71946051.0   NaN
2515          USA    total  2000  282162411.0   NaN
2516          USA  under18  2000   72376189.0   NaN
2517          USA    total  1999  279040181.0   NaN
2518          USA    total  2001  284968955.0   NaN
2519          USA  under18  2001   72671175.0   NaN
2520          USA    total  2002  287625193.0   NaN
2521          USA  under18  2002   72936457.0   NaN
2522          USA    total  2003  290107933.0   NaN
2523          USA  under18  2003   73100758.0   NaN
2524          USA    total  2004  292805298.0   NaN
2525          USA  under18  2004   73297735.0   NaN
2526          USA    total  2005  295516599.0   NaN
2527          USA  under18  2005   73523669.0   NaN
2528          USA    total  2006  298379912.0   NaN
2529          USA  under18  2006   73757714.0   NaN
2530          USA    total  2007  301231207.0   NaN
2531          USA  under18  2007   74019405.0   NaN
2532          USA    total  2008  304093966.0   NaN
2533          USA  under18  2008   74104602.0   NaN
2534          USA  under18  2013   73585872.0   NaN
2535          USA    total  2013  316128839.0   NaN
2536          USA    total  2009  306771529.0   NaN
2537          USA  under18  2009   74134167.0   NaN
2538          USA  under18  2010   74119556.0   NaN
2539          USA    total  2010  309326295.0   NaN
2540          USA  under18  2011   73902222.0   NaN
2541          USA    total  2011  311582564.0   NaN
2542          USA  under18  2012   73708179.0   NaN
2543          USA    total  2012  313873685.0   NaN

In [58]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [55]:
pop_abb_2 = pop_abb[pop_abb["state/region"] != "USA"]
pop_abb_2.loc[pop_abb["state/region"] == "PR", "state"] = "Puerto Rico"
pop_abb_2

     state/region     ages  year  population        state
0              AL  under18  2012   1117489.0      Alabama
1              AL    total  2012   4817528.0      Alabama
2              AL  under18  2010   1130966.0      Alabama
3              AL    total  2010   4785570.0      Alabama
4              AL  under18  2011   1125763.0      Alabama
...           ...      ...   ...         ...          ...
2491           PR  under18  2010    896945.0  Puerto Rico
2492           PR  under18  2011    869327.0  Puerto Rico
2493           PR    total  2011   3686580.0  Puerto Rico
2494           PR  under18  2012    841740.0  Puerto Rico
2495           PR    total  2012   3651545.0  Puerto Rico

[2496 rows x 5 columns]

In [60]:
pop_abb_2[pop_abb_2['year'] == 2010].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104 entries, 2 to 2491
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   state/region  104 non-null    object
 1   ages          104 non-null    object
 2   year          104 non-null    int64
 3   population    104 non-null    float64
 4   state         104 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 4.9+ KB

In [61]:
pop_abb_area = pd.merge(pop_abb_2, areas, how="left", on="state")
pop_abb_area

     state/region     ages  year  population        state  area (sq. mi)
0              AL  under18  2012   1117489.0      Alabama          52423
1              AL    total  2012   4817528.0      Alabama          52423
2              AL  under18  2010   1130966.0      Alabama          52423
3              AL    total  2010   4785570.0      Alabama          52423
4              AL  under18  2011   1125763.0      Alabama          52423
...           ...      ...   ...         ...          ...            ...
2491           PR  under18  2010    896945.0  Puerto Rico           3515
2492           PR  under18  2011    869327.0  Puerto Rico           3515
2493           PR    total  2011   3686580.0  Puerto Rico           3515
2494           PR  under18  2012    841740.0  Puerto Rico           3515
2495           PR    total  2012   3651545.0  Puerto Rico           3515

[2496 rows x 6 columns]

In [90]:
pop_abb_area_2010 = pop_abb_area[(pop_abb_area["year"] == 2010)&(pop_abb_area["ages"] == "total")]
pop_abb_area_2010

,state/region,ages,year,population,state,area (sq. mi)
3,AL,total,2010,4785570.0,Alabama,52423
91,AK,total,2010,713868.0,Alaska,656425
101,AZ,total,2010,6408790.0,Arizona,114006
189,AR,total,2010,2922280.0,Arkansas,53182
197,CA,total,2010,37333601.0,California,163707
283,CO,total,2010,5048196.0,Colorado,104100
293,CT,total,2010,3579210.0,Connecticut,5544
379,DE,total,2010,899711.0,Delaware,1954
389,DC,total,2010,605125.0,District of Columbia,68
475,FL,total,2010,18846054.0,Florida,65758
485,GA,total,2010,9713248.0,Georgia,59441
570,HI,total,2010,1363731.0,Hawaii,10932
581,ID,total,2010,1570718.0,Idaho,83574
666,IL,total,2010,12839695.0,Illinois,57918
677,IN,total,2010,6489965.0,Indiana,36420
762,IA,total,2010,3050314.0,Iowa,56276
773,KS,total,2010,2858910.0,Kansas,82282
858,KY,total,2010,4347698.0,Kentucky,40411
869,LA,total,2010,4545392.0,Louisiana,51843
954,ME,total,2010,1327366.0,Maine,35387
965,MD,total,2010,5787193.0,Maryland,12407
1050,MA,total,2010,6563263.0,Massachusetts,10555
1061,MI,total,2010,9876149.0,Michigan,96810
1146,MN,total,2010,5310337.0,Minnesota,86943
1157,MS,total,2010,2970047.0,Mississippi,48434
1242,MO,total,2010,5996063.0,Missouri,69709
1253,MT,total,2010,990527.0,Montana,147046
1338,NE,total,2010,1829838.0,Nebraska,77358
1349,NV,total,2010,2703230.0,Nevada,110567
1434,NH,total,2010,1316614.0,New Hampshire,9351
1445,NJ,total,2010,8802707.0,New Jersey,8722
1530,NM,total,2010,2064982.0,New Mexico,121593
1541,NY,total,2010,19398228.0,New York,54475
1626,NC,total,2010,9559533.0,North Carolina,53821
1637,ND,total,2010,674344.0,North Dakota,70704
1722,OH,total,2010,11545435.0,Ohio,44828
1733,OK,total,2010,3759263.0,Oklahoma,69903
1818,OR,total,2010,3837208.0,Oregon,98386
1829,PA,total,2010,12710472.0,Pennsylvania,46058
1914,RI,total,2010,1052669.0,Rhode Island,1545
1925,SC,total,2010,4636361.0,South Carolina,32007
2010,SD,total,2010,816211.0,South Dakota,77121
2021,TN,total,2010,6356683.0,Tennessee,42146
2106,TX,total,2010,25245178.0,Texas,268601
2117,UT,total,2010,2774424.0,Utah,84904
2202,VT,total,2010,625793.0,Vermont,9615
2213,VA,total,2010,8024417.0,Virginia,42769
2298,WA,total,2010,6742256.0,Washington,71303
2309,WV,total,2010,1854146.0,West Virginia,24231
2394,WI,total,2010,5689060.0,Wisconsin,65503
2405,WY,total,2010,564222.0,Wyoming,97818
2490,PR,total,2010,3721208.0,Puerto Rico,3515

In [91]:
pop_abb_area_2010.shape

(52, 6)

In [92]:
pop_abb_area_2010.dtypes

state/region      object
ages              object
year               int64
population       float64
state             object
area (sq. mi)      int64
dtype: object

In [93]:
pop_abb_area_2010[pop_abb_area_2010["area (sq. mi)"] == 0]

Empty DataFrame
Columns: [state/region, ages, year, population, state, area (sq. mi)]
Index: []

In [94]:
density = pop_abb_area_2010.loc[:, "population"] / pop_abb_area_2010.loc[:, "area (sq. mi)"]
pop_abb_area_2010.loc[:, "density(hab/sqmi)"] = density
pop_abb_area_2010

C:\Users\alber\AppData\Local\Temp\ipykernel_9176\1473770811.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pop_abb_area_2010.loc[:, "density(hab/sqmi)"] = density

,state/region,ages,year,population,state,area (sq. mi),density(hab/sqmi)
3,AL,total,2010,4785570.0,Alabama,52423,91.287603
91,AK,total,2010,713868.0,Alaska,656425,1.087509
101,AZ,total,2010,6408790.0,Arizona,114006,56.214497
189,AR,total,2010,2922280.0,Arkansas,53182,54.948667
197,CA,total,2010,37333601.0,California,163707,228.051342
283,CO,total,2010,5048196.0,Colorado,104100,48.493718
293,CT,total,2010,3579210.0,Connecticut,5544,645.600649
379,DE,total,2010,899711.0,Delaware,1954,460.445752
389,DC,total,2010,605125.0,District of Columbia,68,8898.897059
475,FL,total,2010,18846054.0,Florida,65758,286.597129
485,GA,total,2010,9713248.0,Georgia,59441,163.409902
570,HI,total,2010,1363731.0,Hawaii,10932,124.746707
581,ID,total,2010,1570718.0,Idaho,83574,18.794338
666,IL,total,2010,12839695.0,Illinois,57918,221.687472
677,IN,total,2010,6489965.0,Indiana,36420,178.197831
762,IA,total,2010,3050314.0,Iowa,56276,54.202751
773,KS,total,2010,2858910.0,Kansas,82282,34.745266
858,KY,total,2010,4347698.0,Kentucky,40411,107.586994
869,LA,total,2010,4545392.0,Louisiana,51843,87.676099
954,ME,total,2010,1327366.0,Maine,35387,37.509990
965,MD,total,2010,5787193.0,Maryland,12407,466.445797
1050,MA,total,2010,6563263.0,Massachusetts,10555,621.815538
1061,MI,total,2010,9876149.0,Michigan,96810,102.015794
1146,MN,total,2010,5310337.0,Minnesota,86943,61.078373
1157,MS,total,2010,2970047.0,Mississippi,48434,61.321530
1242,MO,total,2010,5996063.0,Missouri,69709,86.015622
1253,MT,total,2010,990527.0,Montana,147046,6.736171
1338,NE,total,2010,1829838.0,Nebraska,77358,23.654153
1349,NV,total,2010,2703230.0,Nevada,110567,24.448796
1434,NH,total,2010,1316614.0,New Hampshire,9351,140.799273
1445,NJ,total,2010,8802707.0,New Jersey,8722,1009.253268
1530,NM,total,2010,2064982.0,New Mexico,121593,16.982737
1541,NY,total,2010,19398228.0,New York,54475,356.094135
1626,NC,total,2010,9559533.0,North Carolina,53821,177.617157
1637,ND,total,2010,674344.0,North Dakota,70704,9.537565
1722,OH,total,2010,11545435.0,Ohio,44828,257.549634
1733,OK,total,2010,3759263.0,Oklahoma,69903,53.778278
1818,OR,total,2010,3837208.0,Oregon,98386,39.001565
1829,PA,total,2010,12710472.0,Pennsylvania,46058,275.966651
1914,RI,total,2010,1052669.0,Rhode Island,1545,681.339159
1925,SC,total,2010,4636361.0,South Carolina,32007,144.854594
2010,SD,total,2010,816211.0,South Dakota,77121,10.583512
2021,TN,total,2010,6356683.0,Tennessee,42146,150.825298
2106,TX,total,2010,25245178.0,Texas,268601,93.987655
2117,UT,total,2010,2774424.0,Utah,84904,32.677188
2202,VT,total,2010,625793.0,Vermont,9615,65.085075
2213,VA,total,2010,8024417.0,Virginia,42769,187.622273
2298,WA,total,2010,6742256.0,Washington,71303,94.557817
2309,WV,total,2010,1854146.0,West Virginia,24231,76.519582
2394,WI,total,2010,5689060.0,Wisconsin,65503,86.851900
2405,WY,total,2010,564222.0,Wyoming,97818,5.768079
2490,PR,total,2010,3721208.0,Puerto Rico,3515,1058.665149

In [97]:
pop_abb_area_2010 = pop_abb_area_2010.sort_values(by="density(hab/sqmi)", ascending=False)
pop_abb_area_2010

,state/region,ages,year,population,state,area (sq. mi),density(hab/sqmi)
389,DC,total,2010,605125.0,District of Columbia,68,8898.897059
2490,PR,total,2010,3721208.0,Puerto Rico,3515,1058.665149
1445,NJ,total,2010,8802707.0,New Jersey,8722,1009.253268
1914,RI,total,2010,1052669.0,Rhode Island,1545,681.339159
293,CT,total,2010,3579210.0,Connecticut,5544,645.600649
1050,MA,total,2010,6563263.0,Massachusetts,10555,621.815538
965,MD,total,2010,5787193.0,Maryland,12407,466.445797
379,DE,total,2010,899711.0,Delaware,1954,460.445752
1541,NY,total,2010,19398228.0,New York,54475,356.094135
475,FL,total,2010,18846054.0,Florida,65758,286.597129
1829,PA,total,2010,12710472.0,Pennsylvania,46058,275.966651
1722,OH,total,2010,11545435.0,Ohio,44828,257.549634
197,CA,total,2010,37333601.0,California,163707,228.051342
666,IL,total,2010,12839695.0,Illinois,57918,221.687472
2213,VA,total,2010,8024417.0,Virginia,42769,187.622273
677,IN,total,2010,6489965.0,Indiana,36420,178.197831
1626,NC,total,2010,9559533.0,North Carolina,53821,177.617157
485,GA,total,2010,9713248.0,Georgia,59441,163.409902
2021,TN,total,2010,6356683.0,Tennessee,42146,150.825298
1925,SC,total,2010,4636361.0,South Carolina,32007,144.854594
1434,NH,total,2010,1316614.0,New Hampshire,9351,140.799273
570,HI,total,2010,1363731.0,Hawaii,10932,124.746707
858,KY,total,2010,4347698.0,Kentucky,40411,107.586994
1061,MI,total,2010,9876149.0,Michigan,96810,102.015794
2298,WA,total,2010,6742256.0,Washington,71303,94.557817
2106,TX,total,2010,25245178.0,Texas,268601,93.987655
3,AL,total,2010,4785570.0,Alabama,52423,91.287603
869,LA,total,2010,4545392.0,Louisiana,51843,87.676099
2394,WI,total,2010,5689060.0,Wisconsin,65503,86.851900
1242,MO,total,2010,5996063.0,Missouri,69709,86.015622
2309,WV,total,2010,1854146.0,West Virginia,24231,76.519582
2202,VT,total,2010,625793.0,Vermont,9615,65.085075
1157,MS,total,2010,2970047.0,Mississippi,48434,61.321530
1146,MN,total,2010,5310337.0,Minnesota,86943,61.078373
101,AZ,total,2010,6408790.0,Arizona,114006,56.214497
189,AR,total,2010,2922280.0,Arkansas,53182,54.948667
762,IA,total,2010,3050314.0,Iowa,56276,54.202751
1733,OK,total,2010,3759263.0,Oklahoma,69903,53.778278
283,CO,total,2010,5048196.0,Colorado,104100,48.493718
1818,OR,total,2010,3837208.0,Oregon,98386,39.001565
954,ME,total,2010,1327366.0,Maine,35387,37.509990
773,KS,total,2010,2858910.0,Kansas,82282,34.745266
2117,UT,total,2010,2774424.0,Utah,84904,32.677188
1349,NV,total,2010,2703230.0,Nevada,110567,24.448796
1338,NE,total,2010,1829838.0,Nebraska,77358,23.654153
581,ID,total,2010,1570718.0,Idaho,83574,18.794338
1530,NM,total,2010,2064982.0,New Mexico,121593,16.982737
2010,SD,total,2010,816211.0,South Dakota,77121,10.583512
1637,ND,total,2010,674344.0,North Dakota,70704,9.537565
1253,MT,total,2010,990527.0,Montana,147046,6.736171
2405,WY,total,2010,564222.0,Wyoming,97818,5.768079
91,AK,total,2010,713868.0,Alaska,656425,1.087509

In [99]:
pop_abb_area_2010["top"] = range(1, len(pop_abb_area_2010) + 1)

In [100]:
pop_abb_area_2010

,state/region,ages,year,population,state,area (sq. mi),density(hab/sqmi),top
389,DC,total,2010,605125.0,District of Columbia,68,8898.897059,1
2490,PR,total,2010,3721208.0,Puerto Rico,3515,1058.665149,2
1445,NJ,total,2010,8802707.0,New Jersey,8722,1009.253268,3
1914,RI,total,2010,1052669.0,Rhode Island,1545,681.339159,4
293,CT,total,2010,3579210.0,Connecticut,5544,645.600649,5
1050,MA,total,2010,6563263.0,Massachusetts,10555,621.815538,6
965,MD,total,2010,5787193.0,Maryland,12407,466.445797,7
379,DE,total,2010,899711.0,Delaware,1954,460.445752,8
1541,NY,total,2010,19398228.0,New York,54475,356.094135,9
475,FL,total,2010,18846054.0,Florida,65758,286.597129,10
1829,PA,total,2010,12710472.0,Pennsylvania,46058,275.966651,11
1722,OH,total,2010,11545435.0,Ohio,44828,257.549634,12
197,CA,total,2010,37333601.0,California,163707,228.051342,13
666,IL,total,2010,12839695.0,Illinois,57918,221.687472,14
2213,VA,total,2010,8024417.0,Virginia,42769,187.622273,15
677,IN,total,2010,6489965.0,Indiana,36420,178.197831,16
1626,NC,total,2010,9559533.0,North Carolina,53821,177.617157,17
485,GA,total,2010,9713248.0,Georgia,59441,163.409902,18
2021,TN,total,2010,6356683.0,Tennessee,42146,150.825298,19
1925,SC,total,2010,4636361.0,South Carolina,32007,144.854594,20
1434,NH,total,2010,1316614.0,New Hampshire,9351,140.799273,21
570,HI,total,2010,1363731.0,Hawaii,10932,124.746707,22
858,KY,total,2010,4347698.0,Kentucky,40411,107.586994,23
1061,MI,total,2010,9876149.0,Michigan,96810,102.015794,24
2298,WA,total,2010,6742256.0,Washington,71303,94.557817,25
2106,TX,total,2010,25245178.0,Texas,268601,93.987655,26
3,AL,total,2010,4785570.0,Alabama,52423,91.287603,27
869,LA,total,2010,4545392.0,Louisiana,51843,87.676099,28
2394,WI,total,2010,5689060.0,Wisconsin,65503,86.851900,29
1242,MO,total,2010,5996063.0,Missouri,69709,86.015622,30
2309,WV,total,2010,1854146.0,West Virginia,24231,76.519582,31
2202,VT,total,2010,625793.0,Vermont,9615,65.085075,32
1157,MS,total,2010,2970047.0,Mississippi,48434,61.321530,33
1146,MN,total,2010,5310337.0,Minnesota,86943,61.078373,34
101,AZ,total,2010,6408790.0,Arizona,114006,56.214497,35
189,AR,total,2010,2922280.0,Arkansas,53182,54.948667,36
762,IA,total,2010,3050314.0,Iowa,56276,54.202751,37
1733,OK,total,2010,3759263.0,Oklahoma,69903,53.778278,38
283,CO,total,2010,5048196.0,Colorado,104100,48.493718,39
1818,OR,total,2010,3837208.0,Oregon,98386,39.001565,40
954,ME,total,2010,1327366.0,Maine,35387,37.509990,41
773,KS,total,2010,2858910.0,Kansas,82282,34.745266,42
2117,UT,total,2010,2774424.0,Utah,84904,32.677188,43
1349,NV,total,2010,2703230.0,Nevada,110567,24.448796,44
1338,NE,total,2010,1829838.0,Nebraska,77358,23.654153,45
581,ID,total,2010,1570718.0,Idaho,83574,18.794338,46
1530,NM,total,2010,2064982.0,New Mexico,121593,16.982737,47
2010,SD,total,2010,816211.0,South Dakota,77121,10.583512,48
1637,ND,total,2010,674344.0,North Dakota,70704,9.537565,49
1253,MT,total,2010,990527.0,Montana,147046,6.736171,50
2405,WY,total,2010,564222.0,Wyoming,97818,5.768079,51
91,AK,total,2010,713868.0,Alaska,656425,1.087509,52

In [51]:
merged = pd.merge(pop, abbrevs, how='outer',
                  left_on='state/region', right_on='abbreviation')
merged = merged.drop('abbreviation', 1) # drop duplicate info
# merged = merged.iloc[:, list(range(1)) +\
#                     [list(merged.columns).index("state")] +\
#                     list(range(2, list(merged.columns).index("state"))) +\
#                     list(range(list(merged.columns).index("state") +1, len(merged.columns)))]
merged.head()

C:\Users\alber\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:3: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  This is separate from the ipykernel package so we can avoid doing imports until

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [53]:
merged[merged["state/region"] == "USA"]

     state/region     ages  year   population state
2496          USA  under18  1990   64218512.0   NaN
2497          USA    total  1990  249622814.0   NaN
2498          USA    total  1991  252980942.0   NaN
2499          USA  under18  1991   65313018.0   NaN
2500          USA  under18  1992   66509177.0   NaN
2501          USA    total  1992  256514231.0   NaN
2502          USA    total  1993  259918595.0   NaN
2503          USA  under18  1993   67594938.0   NaN
2504          USA  under18  1994   68640936.0   NaN
2505          USA    total  1994  263125826.0   NaN
2506          USA  under18  1995   69473140.0   NaN
2507          USA  under18  1996   70233512.0   NaN
2508          USA    total  1995  266278403.0   NaN
2509          USA    total  1996  269394291.0   NaN
2510          USA    total  1997  272646932.0   NaN
2511          USA  under18  1997   70920738.0   NaN
2512          USA  under18  1998   71431406.0   NaN
2513          USA    total  1998  275854116.0   NaN
2514          USA  under18  1999   71946051.0   NaN
2515          USA    total  2000  282162411.0   NaN
2516          USA  under18  2000   72376189.0   NaN
2517          USA    total  1999  279040181.0   NaN
2518          USA    total  2001  284968955.0   NaN
2519          USA  under18  2001   72671175.0   NaN
2520          USA    total  2002  287625193.0   NaN
2521          USA  under18  2002   72936457.0   NaN
2522          USA    total  2003  290107933.0   NaN
2523          USA  under18  2003   73100758.0   NaN
2524          USA    total  2004  292805298.0   NaN
2525          USA  under18  2004   73297735.0   NaN
2526          USA    total  2005  295516599.0   NaN
2527          USA  under18  2005   73523669.0   NaN
2528          USA    total  2006  298379912.0   NaN
2529          USA  under18  2006   73757714.0   NaN
2530          USA    total  2007  301231207.0   NaN
2531          USA  under18  2007   74019405.0   NaN
2532          USA    total  2008  304093966.0   NaN
2533          USA  under18  2008   74104602.0   NaN
2534          USA  under18  2013   73585872.0   NaN
2535          USA    total  2013  316128839.0   NaN
2536          USA    total  2009  306771529.0   NaN
2537          USA  under18  2009   74134167.0   NaN
2538          USA  under18  2010   74119556.0   NaN
2539          USA    total  2010  309326295.0   NaN
2540          USA  under18  2011   73902222.0   NaN
2541          USA    total  2011  311582564.0   NaN
2542          USA  under18  2012   73708179.0   NaN
2543          USA    total  2012  313873685.0   NaN

Let's double-check whether there were any mismatches here, which we can do by looking for rows with nulls:

In [44]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

Some of the ``population`` info is null; let's figure out which these are!

In [24]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

It appears that all the null population values are from Puerto Rico prior to the year 2000; this is likely due to this data not being available from the original source.

More importantly, we see also that some of the new ``state`` entries are also null, which means that there was no corresponding entry in the ``abbrevs`` key!
Let's figure out which regions lack this match:

In [50]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

We can quickly infer the issue: our population data includes entries for Puerto Rico (PR) and the United States as a whole (USA), while these entries do not appear in the state abbreviation key.
We can fix these quickly by filling in appropriate entries:

In [54]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [57]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

No more nulls in the ``state`` column: we're all set!

Now we can merge the result with the area data using a similar procedure.
Examining our results, we will want to join on the ``state`` column in both:

In [27]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

Again, let's check for nulls to see if there were any mismatches:

In [28]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

There are nulls in the ``area`` column; we can take a look to see which regions were ignored here:

In [29]:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

We see that our ``areas`` ``DataFrame`` does not contain the area of the United States as a whole.
We could insert the appropriate value (using the sum of all state areas, for instance), but in this case we'll just drop the null values because the population density of the entire United States is not relevant to our current discussion:

In [30]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

Now we have all the data we need. To answer the question of interest, let's first select the portion of the data corresponding with the year 2000, and the total population.
We'll use the ``query()`` function to do this quickly (this requires the ``numexpr`` package to be installed; see [High-Performance Pandas: ``eval()`` and ``query()``](03.12-Performance-Eval-and-Query.ipynb)):

In [31]:
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

Now let's compute the population density and display it in order.
We'll start by re-indexing our data on the state, and then compute the result:

In [32]:
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']

In [33]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

The result is a ranking of US states plus Washington, DC, and Puerto Rico in order of their 2010 population density, in residents per square mile.
We can see that by far the densest region in this dataset is Washington, DC (i.e., the District of Columbia); among states, the densest is New Jersey.

We can also check the end of the list:

In [34]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

We see that the least dense state, by far, is Alaska, averaging slightly over one resident per square mile.

This type of messy data merging is a common task when trying to answer questions using real-world data sources.
I hope that this example has given you an idea of the ways you can combine tools we've covered in order to gain insight from your data!